<a href="https://colab.research.google.com/github/19PA1A0248/AI-Lab/blob/master/Experiment_2(Pandas)_248.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#EXPERMIENT NO:-2 (PANDAS)

In [ ]:

import pandas as pd
import numpy as np

##1) Create a Dataframe manually.

In [ ]:
# let's see a program to create a dataframe manually
df=pd.DataFrame({"Roll No":["EEE222","EEE204","EEE248"],"Name":["D.pavan kumari","A.V. Chenna krishna","K.Bhavyasree"]})
df

  Roll No                 Name
0  EEE222       D.pavan kumari
1  EEE204  A.V. Chenna krishna
2  EEE248         K.Bhavyasree

##2) Import data into dataframe

In [ ]:
import pandas as pd
df=pd.read_csv("students_placement_data.csv")
df.head()

   Roll No Gender  ... registered_for_ Placement_Training  placement status
0        1      M  ...                                 NO        Not placed
1        2      F  ...                                yes            Placed
2        3      F  ...                                yes        Not placed
3        4      M  ...                                yes        Not placed
4        5      M  ...                                yes        Not placed

[5 rows x 9 columns]

In [ ]:
df.isna().any()

Roll No                               False
Gender                                False
Section                               False
SSC Percentage                         True
inter_Diploma_percentage              False
B.Tech_percentage                     False
Backlogs                              False
registered_for_ Placement_Training     True
placement status                      False
dtype: bool

In [ ]:
df.describe()

          Roll No  SSC Percentage  ...  B.Tech_percentage    Backlogs
count  117.000000      116.000000  ...         117.000000  117.000000
mean    59.000000       80.474569  ...          62.943419    4.111111
std     33.919021        8.836079  ...          12.064306    6.335148
min      1.000000       47.800000  ...          31.200000    0.000000
25%     30.000000       76.622500  ...          54.180000    0.000000
50%     59.000000       82.745000  ...          64.360000    0.000000
75%     88.000000       87.025000  ...          72.570000    7.000000
max    117.000000       93.660000  ...          88.100000   25.000000

[8 rows x 5 columns]

##3)Adding, Deleting, Modifying the rows/columns in a dataframe

###3.1)Adding a column

### Add an extra column "hostler/day's scholar" to studentâ€™s data

In [ ]:
# Let's write a program for adding a coloumn in a dataframe.
host_day=pd.read_csv("hostlers_day_scholars.csv")
host_day.head()

  hostler/days scholar
0                    d
1                    d
2                    d
3                    d
4                    h

In [ ]:
df["hostlers/days scholar"] = host_day.values
df.head()

   Roll No Gender  ... placement status  hostlers/days scholar
0        1      M  ...       Not placed                      d
1        2      F  ...           Placed                      d
2        3      F  ...       Not placed                      d
3        4      M  ...       Not placed                      d
4        5      M  ...       Not placed                      h

[5 rows x 10 columns]

### 3.2)Deleting a column

 "registered_for_ Placement_Training" is no more needed. Can you delete it?

In [ ]:
del df["registered_for_ Placement_Training"]
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostlers/days scholar
0        1      M       A  ...        18        Not placed                      d
1        2      F       A  ...         0            Placed                      d
2        3      F       A  ...        13        Not placed                      d
3        4      M       A  ...        17        Not placed                      d
4        5      M       A  ...        17        Not placed                      h

[5 rows x 9 columns]

### 3.3)Adding a row

A new student got transferred from SVECW to VIT. Can you add her information?

Her details

'Roll No': 118

'Gender': F

'Section': C

SSC Percentage' 98.4

'inter_Diploma_percentage':99

'B.Tech_percentage':75

'Backlogs': 0

'registered_for_ Placement_Training': Not applicable

'hostler/day's scholar': hostler

'placement status': Not placed

In [ ]:
#Let's create a dataframe with her details
df1 = pd.DataFrame({"Rollno":[118],"Gender":["F"],"Section":["C"],"SSC Percentage":[98.4],"inter_Diploma_peecentage":[99],"B.Tech_percentage":[75],"Backlogs":[0],"registered_for_Placement_Training":["Not applicable"],"hostler/day's scholar":["hostler"],"placement_status":["Not placed"]})
df1

   Rollno Gender  ... hostler/day's scholar  placement_status
0     118      F  ...               hostler        Not placed

[1 rows x 10 columns]

In [ ]:
#Let's write a program to append the data
import pandas as pd
df = df.append(df1)
df.head()

   Roll No Gender  ... hostlers/days scholar  hostler/days scholar
0        1      M  ...                     d                   NaN
1        2      F  ...                     d                   NaN
2        3      F  ...                     d                   NaN
3        4      M  ...                     d                   NaN
4        5      M  ...                     h                   NaN

[5 rows x 10 columns]

### 3.4)Deleting a row

 Roll number 4 got transferred to another college. Now his information is no more needed. Now delete roll number 4 information.

In [ ]:
#let's write a program for the deletion of rows in a dataframe
df=df.drop(3)
df.head()

   Roll No Gender  ... hostlers/days scholar  hostler/days scholar
0        1      M  ...                     d                   NaN
1        2      F  ...                     d                   NaN
2        3      F  ...                     d                   NaN
4        5      M  ...                     h                   NaN
5        6      M  ...                     h                   NaN

[5 rows x 10 columns]

###3.5) Modifying elements

Roll number 2 has shifted to the hostel. Can you change her details?

In [ ]:
#let's write a program for modifying elements in a dataframe
df.loc[1,'hostler/days scholar']="h"
df.head()

   Roll No Gender  ... hostlers/days scholar  hostler/days scholar
0        1      M  ...                     d                   NaN
1        2      F  ...                     d                     h
2        3      F  ...                     d                   NaN
4        5      M  ...                     h                   NaN
5        6      M  ...                     h                   NaN

[5 rows x 10 columns]

## 4) Applying functions on a dataframe.

### Say, the university has decided to give grace percentage of 0.05 to people who have less than 70% in B.tech. Can you do the same using the apply function?

In [ ]:
def gracep(x):
  if (x<70):
     return (x+0.05)
  else:
     return (x)

In [ ]:
df["B.Tech_percentage"] = df["B.Tech_percentage"].apply(gracep)
df.head()

   Roll No Gender  ... hostlers/days scholar  hostler/days scholar
0        1      M  ...                     d                   NaN
1        2      F  ...                     d                     h
2        3      F  ...                     d                   NaN
4        5      M  ...                     h                   NaN
5        6      M  ...                     h                   NaN

[5 rows x 10 columns]

## 5) Iterations on dataframe

Display the roll number and B.tech percentage of students who got more than 80% in B.tech using iterations. ( No need to create a dataframe)

In [70]:
#Let's write a program for iterations on dataframe
for index,rows in df[df["B.Tech_percentage"]>=80].iterrows():
    print(rows["Roll No"],"-",rows["B.Tech_percentage"])

18 - 85.39
18 - 85.39
60 - 81.1
60 - 81.1
71 - 80.47
71 - 80.47
97 - 88.1
97 - 88.1
102 - 83.38
102 - 83.38

## 6) Accessing the elements from a dataframe

### Can you display the SSC and Intermediate percentage of Roll number 2 and 3?

In [ ]:
df.loc[[1,2],["SSC Percentage","inter_Diploma_percentage"]]

   SSC Percentage  inter_Diploma_percentage
1            87.3                      65.3
2            89.0                      92.4

## 7) Different ways to deal with NAâ€™s in dataframe

### SSC percentage of roll number is missing. Can you replace the missing value using the mean of SSC percentage?

In [ ]:
import numpy as np
import pandas as pd
df["SSC Percentage"]=df["SSC Percentage"].replace(to_replace=np.mean(df["SSC Percentage"]))
df.head()

   Roll No Gender Section  ...  hostler/days scholar  Urban/Rural_x  Urban/Rural_y
0        1      M       A  ...                   NaN          Urban          Urban
1        1      M       A  ...                   NaN          Urban          Urban
2        2      F       A  ...                     h          Rural          Rural
3        2      F       A  ...                     h          Rural          Rural
4        3      F       A  ...                   NaN          Urban          Urban

[5 rows x 12 columns]

## 8) Groupby operations on dataframe

### What is the average B.Tech percentage of Male and Female students? Use Groupby.

In [ ]:
import numpy as np
import pandas as pd
grouped=df.groupby("Gender")
grouped["B.Tech_percentage"].agg(np.mean)

Gender
F    71.277449
M    57.495373
Name: B.Tech_percentage, dtype: float64

## 9) Merging the dataframes

### There is another file urban_rural.csv from the above link having information about student's place information (Urban/rural). Can you merge the dataframe with the student's data?

In [ ]:
import pandas as pd
df2=pd.read_csv("urban_rural.csv")
df2.head()

   Roll No Urban/Rural
0        1       Urban
1        2       Rural
2        6       Rural
3        7       Urban
4        8       Urban

In [ ]:
df=pd.merge(df,df2,on='Roll No')
df.head()

   Roll No Gender Section  ...  hostler/days scholar  Urban/Rural_x  Urban/Rural_y
0        1      M       A  ...                   NaN          Urban          Urban
1        1      M       A  ...                   NaN          Urban          Urban
2        2      F       A  ...                     h          Rural          Rural
3        2      F       A  ...                     h          Rural          Rural
4        3      F       A  ...                   NaN          Urban          Urban

[5 rows x 12 columns]